In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data=pd.read_csv('Titanic.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.drop(columns=['Name','Ticket'],inplace=True)

In [5]:
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S

In [6]:
data['Sex'].replace({'male':1,'female':0},inplace=True)

In [7]:
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,1,22.0,1,0,7.2500,NaN,S
1,2,1,1,0,38.0,1,0,71.2833,C85,C
2,3,1,3,0,26.0,0,0,7.9250,NaN,S
3,4,1,1,0,35.0,1,0,53.1000,C123,S
4,5,0,3,1,35.0,0,0,8.0500,NaN,S

In [8]:
data.fillna({'Cabin':'no'},inplace=True)

In [9]:
len(data['Cabin'])

891

In [10]:
data['Cabin'].value_counts()

no                 687
B96 B98              4
G6                   4
C23 C25 C27          4
C22 C26              3
D                    3
F2                   3
F33                  3
E101                 3
B18                  2
B49                  2
B20                  2
C93                  2
B28                  2
E24                  2
B58 B60              2
C52                  2
E8                   2
C68                  2
B5                   2
B57 B59 B63 B66      2
E67                  2
D36                  2
D17                  2
B77                  2
C126                 2
C124                 2
C125                 2
C83                  2
B35                  2
                  ...
D19                  1
D46                  1
E77                  1
B19                  1
A26                  1
C106                 1
D49                  1
D28                  1
A20                  1
C54                  1
A36                  1
B102                 1
D11                  1
C45                  1
D50                  1
D45                  1
A14                  1
B69                  1
C128                 1
A10                  1
C47                  1
C85                  1
C87                  1
C70                  1
C90                  1
C148                 1
C95                  1
E10                  1
F G63                1
A6                   1
Name: Cabin, Length: 148, dtype: int64

In [11]:
data=data[data['Cabin']=='no']

In [12]:
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,1,22.0,1,0,7.2500,no,S
2,3,1,3,0,26.0,0,0,7.9250,no,S
4,5,0,3,1,35.0,0,0,8.0500,no,S
5,6,0,3,1,NaN,0,0,8.4583,no,Q
7,8,0,3,1,2.0,3,1,21.0750,no,S

In [13]:
data=data.dropna(subset=['Age'])

In [14]:
data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,1,22.0,1,0,7.2500,no,S
2,3,1,3,0,26.0,0,0,7.9250,no,S
4,5,0,3,1,35.0,0,0,8.0500,no,S
7,8,0,3,1,2.0,3,1,21.0750,no,S
8,9,1,3,0,27.0,0,2,11.1333,no,S

In [15]:
len(data['Embarked'])

529

In [16]:
data['Embarked'].value_counts()

S    438
C     65
Q     26
Name: Embarked, dtype: int64

In [17]:
data=data[data['Embarked']=='S']

In [18]:
data.drop(columns=['Embarked','Cabin'],inplace=True)

In [19]:
data.corr()['Survived']

PassengerId   -0.038657
Survived       1.000000
Pclass        -0.261689
Sex           -0.508126
Age           -0.087760
SibSp         -0.020259
Parch          0.118752
Fare           0.183608
Name: Survived, dtype: float64

In [20]:
data.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    1  22.0      1      0   7.2500
2            3         1       3    0  26.0      0      0   7.9250
4            5         0       3    1  35.0      0      0   8.0500
7            8         0       3    1   2.0      3      1  21.0750
8            9         1       3    0  27.0      0      2  11.1333

In [21]:
data['Pclass'].value_counts()

3    280
2    143
1     15
Name: Pclass, dtype: int64

In [22]:
len(data['Pclass'])

438

In [23]:
y=data.iloc[:,1]

In [24]:
y.shape

(438,)

In [25]:
X=data.drop(columns=['Survived','PassengerId']).iloc[:,:]

In [26]:
X.shape

(438, 6)

In [39]:
from sklearn.model_selection import train_test_split

In [28]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=7)

In [29]:
from sklearn.tree import DecisionTreeClassifier

In [30]:
classifier=DecisionTreeClassifier()

In [31]:
classifier.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [32]:
y_pred=classifier.predict(X_test)

In [35]:
from sklearn.metrics import accuracy_score

In [40]:
accuracy_score(y_test,y_pred)

0.8295454545454546